Backend/app/controllers/api/v1/authentications_controller.rb

  def get_nonce
    user = User.find_or_create_by address: params[:address]
---
INSERT INTO `users` (`address`, `created_at`, `updated_at`) VALUES ('0x85ebd95193a51ef15d2fd94d3dd35fa0ead4679a', '2018-12-21 06:46:37', '2018-12-21 06:46:37')
SELECT  `users`.* FROM `users` WHERE `users`.`address` = '0x85ebd95193a51ef15d2fd94d3dd35fa0ead4679a' LIMIT 1

  def authenticate
    random = Random.new
    auth_token = AuthenticateUser.new(auth_params[:address], auth_params[:signature]).call
    user = User.find_by address: auth_params[:address]
    render json: {
      status: true,
      auth_token: auth_token,
      name: user.name
    }
    new_nonce = random.rand(100)
    while(new_nonce == user.nonce)
      new_nonce = random.rand(100)
    end
    user.update_attributes nonce: new_nonce
---
SELECT  `users`.* FROM `users` WHERE `users`.`address` = '0x85ebd95193a51ef15d2fd94d3dd35fa0ead4679a' LIMIT 1
UPDATE `users` SET `nonce` = 66, `updated_at` = '2018-12-21 06:49:44' WHERE `users`.`id` = 1