Backend/app/controllers/api/v1/users_controller.rb

  def update
    if @user.update_attributes user_params
---
UPDATE `users` SET `name` = 'hi', `updated_at` = '2018-12-21 09:04:04' WHERE `users`.`id` = 1

  def load_user
    @user = User.find_by id: params[:id]
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1